package main

import (
	"fmt"
	"log"
	"net/http"
	"strconv"
)

func main() {
	StartWebApiServer(80)
	log.Println("[+mock_main]Start to run mock_agnet")
}

var (
	/*
		locations = "{" +
			"\"status\":\"ok\"," +
			"\"locations\":" +
			"[{\"id\":\"1\",\"lat\":\"25.0475818\",\"lng\":\"121.56107259999999\",\"addr\":\"105台灣台北市松山區八德路四段106巷4弄1號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"2\",\"lat\":\"25.0564399\",\"lng\":\"121.56637890000002\",\"addr\":\"105台灣台北市松山區健康路325巷25弄12-20號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"3\",\"lat\":\"25.05148802843398\",\"lng\":\"121.5768313407898\",\"addr\":\"105台灣台北市松山區松河街206號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"4\",\"lat\":\"25.0509356\",\"lng\":\"121.57467489999999\",\"addr\":\"105台灣台北市松山區松河街96號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"5\",\"lat\":\"25.0481294\",\"lng\":\"121.54369199999996\",\"addr\":\"104台灣台北市中山區復興北路10號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"6\",\"lat\":\"25.048134738098064\",\"lng\":\"121.54882907867432\",\"addr\":\"105台灣台北市松山區八德路二段\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"7\",\"lat\":\"25.059253702170512\",\"lng\":\"121.56838238304772\",\"addr\":\"105台灣台北市松山區撫遠街187號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"8\",\"lat\":\"25.0527495\",\"lng\":\"121.56202289999999\",\"addr\":\"105台灣台北市松山區南京東路五段147巷12號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"{\"id\":\"9\",\"lat\":\"25.0570305\",\"lng\":\"121.54477529999997\",\"addr\":\"105台灣台北市松山區民生東路三段110巷8-12號\",\"type\":\"1\",\"bound\":" +
			"[{\"lat\":\"25.060556032463364\",\"lng\":\"121.55810415744781\"},{\"lat\":\"25.062198503729796\",\"lng\":\"121.56180560588837\"}]}," +
			"}"
	*/
	//25.060556032463364, 121.55810415744781 25.062198503729796 121.56180560588837
	alarmLocation = "{" +
		"\"status\":\"ok\"," +
		"\"locations\":" +
		"[{\"id\":\"1\",\"lat\":25.0475818,\"lng\":121.56107259999999,\"addr\":\"105台灣台北市松山區八德路四段106巷4弄1號\",\"desc\":\"臺北市松山區八德路4段106巷附近\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.048569699048144,\"lng\":121.56107872724533},{\"lat\":25.04656983789473,\"lng\":121.56103044748306}]}," +
		"{\"id\":\"2\",\"lat\":25.0564399,\"lng\":121.56637890000002,\"addr\":\"105台灣台北市松山區健康路325巷25弄12-20號\",\"desc\":\"臺北市松山區健康路325巷25弄附近\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.056629562077543,\"lng\":121.56710028648376},{\"lat\":25.056235936217178,\"lng\":121.5654855966568}]}," +
		"{\"id\":\"3\",\"lat\":25.05148802843398,\"lng\":121.5768313407898,\"addr\":\"105台灣台北市松山區松河街206號\",\"desc\":\"臺北市松山區松河街4號水門內\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.051898678753158,\"lng\":121.57779157161713},{\"lat\":25.05127176833034,\"lng\":121.57590866088867}]}," +
		"{\"id\":\"4\",\"lat\":25.04859642844167,\"lng\":121.54377311468124,\"addr\":\"105台灣台北市松山區松河街96號\",\"desc\":\"臺北市松山區松河街80幾號附近\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.049374008248257,\"lng\":121.54417008161545},{\"lat\":25.0481294,\"lng\":121.54369199999996}]}," +
		"{\"id\":\"5\",\"lat\":25.0481294,\"lng\":121.54369199999996,\"addr\":\"104台灣台北市中山區復興北路10號\",\"desc\":\"臺北市松山區復興北路10幾號附近\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.06145502094316,\"lng\":121.55706882476807},{\"lat\":25.061207192345094,\"lng\":121.56029284000397}]}," +
		"{\"id\":\"6\",\"lat\":25.04715303285188,\"lng\":121.54548704632361,\"addr\":\"105台灣台北市松山區八德路二段346巷5弄\",\"desc\":\"臺北市松山區八德路2段346巷5弄附近\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.047211352195042,\"lng\":121.54596716165543},{\"lat\":25.047055833885004,\"lng\":121.5449894964695}]}," +
		"{\"id\":\"7\",\"lat\":25.048199,\"lng\":121.54891799999996,\"addr\":\"台灣台北市松山區八德路二段\",\"desc\":\"臺北市松山區敦化北路與八德路口地下道\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.048681476473217,\"lng\":121.54929041862488},{\"lat\":25.04773136511165,\"lng\":121.54854208230972}]}," +
		"{\"id\":\"9\",\"lat\":25.059258,\"lng\":121.56837999999993,\"addr\":\"台灣台北市松山區撫遠街187號\",\"desc\":\"臺北市松山區民生東路5段撫遠街口\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.05938369283475,\"lng\":121.56856745481491},{\"lat\":25.059156512798758,\"lng\":121.56818121671677}]}," +
		"{\"id\":\"10\",\"lat\":25.0527495,\"lng\":121.56202289999999,\"addr\":\"105台灣台北市松山區南京東路五段147巷12號\",\"desc\":\"臺北市松山區南京東路5段147巷內(西松國小後門)\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.05340033481183,\"lng\":121.56212478876114},{\"lat\":25.05206634024398,\"lng\":121.56186729669571}]}," +
		"{\"id\":\"11\",\"lat\":25.057008608007447,\"lng\":121.54477529999997,\"addr\":\"105台灣台北市松山區復興北路231巷6-34號\",\"desc\":\"臺北市松山區復興北路231巷\",\"type\":1,\"bound\":" +
		"[{\"lat\":25.057093650202496,\"lng\":121.54621928930283},{\"lat\":25.056943003988103,\"lng\":121.54428541660309}]}]" +
		"}"
)

func StartWebApiServer(port int) {
	log.Println("[--mock_webapi][port:", port, "]", "StartWebApiServer Start!")
	http.HandleFunc("/check", CheckAlive)
	http.HandleFunc("/getcoord", GetCoordinate)
	http.HandleFunc("/reportdanger", ReportDanger)
	err := http.ListenAndServe("0.0.0.0:"+strconv.Itoa(port), nil) //設置監聽的端口
	if err != nil {
		log.Println("[--mock_webapi]StartWebApiServer Start Failed! err = ", err)
		return
	}
}

func CheckAlive(w http.ResponseWriter, r *http.Request) {
	log.Println("[mock_webapi]CheckAlive:")
	defer r.Body.Close()
	fmt.Fprintf(w, "OK")
}

func GetCoordinate(w http.ResponseWriter, r *http.Request) {
	//fmt.Fprintf(w, locations)
	fmt.Fprintf(w, alarmLocation)
	//fmt.Fprintf(w, "{\"MTime\":%d,\"Did\":\"%s\",\"Rs\":\"%s\"}", data.MTime, data.Did, data.Rs)
}

func ReportDanger(w http.ResponseWriter, r *http.Request) {
	myloclat := r.FormValue("lat")
	myloclng := r.FormValue("lng")
	log.Println("Recieve from lat=", myloclat, " lng=", myloclng)
	fmt.Fprintf(w, "OK")
}
